[Config]
IDS_Language=En


[En]
IDS_Title = TDS Workshop

IDS_Menu_Doc = Project
IDS_Menu_Language = Language
IDS_Menu_Tool = Tool
IDS_Menu_About = Help

IDS_Menu_Doc_New = New Project
IDS_Menu_Doc_Open = Open Project
IDS_Menu_Doc_Save = Save Project
IDS_Menu_Doc_SaveAs = Save Project as
IDS_Menu_Doc_Example = Platform Example
IDS_Menu_Doc_TDS = TDS water quality detection pen
IDS_Menu_Doc_SingleTube = Single-channel water quality detection module
IDS_Menu_Doc_DoubleTube = Dual-channel water quality detection module
IDS_Menu_Doc_Exit = Exit

IDS_Menu_Language_English = English
IDS_Menu_Language_SimpChinese = 简体中文
IDS_Menu_Language_TranChinese = 繁體中文

IDS_Menu_Tool_MonitoringWindow = Calibration Monitoring
IDS_Menu_Tool_2 = Open Data
IDS_Menu_Tool_3 = Save Data
IDS_Menu_Tool_4 = Output Data
IDS_Menu_Tool_5 = Print

IDS_Menu_About_Direction = Direction for use
IDS_Menu_About_Instance = Instance Declaration
IDS_Menu_About_Update = Check for updates
IDS_Menu_About_About = About platform

IDS_EXAMPLE_NAME = ExampleName
IDS_EXAMPLE_Volt = Operating Voltage
IDS_EXAMPLE_Fre = SystemFrequency
IDS_EXAMPLE_MCU_MODEL = MCU Part Number
IDS_EXAMPLE_TDS_SETTING = TDS Setting
IDS_EXAMPLE_NTC_SETTING = NTC Setting
IDS_EXAMPLE_COMMUNICATE = CommunicateAPI
IDS_EXAMPLE_DISPLAY = Display
IDS_EXAMPLE_BUTTON = ButtonNum
IDS_EXAMPLE_TEMPR = Temp Range
IDS_EXAMPLE_MECSURER = TDS Measurement Range
IDS_EXAMPLE_MECSUREA = TDS Measurement Accuracy
IDS_EXAMPLE_NEW = Export Example

IDS_NAVIGATION_Main = Begin
IDS_NAVIGATION_TDS = TDS Configuration
IDS_NAVIGATION_NTC = NTC Configuration
IDS_NAVIGATION_MCU = MCU Configuration
IDS_NAVIGATION_OVER = Complete

IDS_PageBegin_History = Recently Opened Projects 
IDS_PageBegin_NewDoc =      New Project     
IDS_PageBegin_Platform =    Platform Example   
IDS_PageBegin_Calibration = Calibration Monitoring

IDS_ProjectPathFind_STA = Choice the Project Path
IDS_NEWPRJ_NAME = Project Name:
IDS_NEWPRJ_LOCATION = Project Location:
IDS_NEWPRJ_PACKAGE = Package:
IDS_Next = Next
IDS_Over = OK
IDS_Back = Back  
IDS_Return = Return

IDS_TDS_MCU_TYPE = MCU Selection:
IDS_TDS_PACKAGE = Package:
IDS_TDS_TUBE = TDS Channel:

IDS_TDS_TUBE1SET = Channel 1 Settings
IDS_TDS_TUBE2SET = Channel 2 Settings
IDS_TDS_PROBE_TYPE = Probe Selection:
IDS_TDS_PROBE_MODE = Probe View:
IDS_TDS_CALIBRATION_MODE = Calibration Mode:
IDS_TDS_DESCRIBE = Description
IDS_TDS_DOCUMENT = Document

IDS_NTC_NTCTUBE = NTC Channel:
IDS_NTCTUBE_SET1 = Channel 1 Settings
IDS_NTCTUBE_SET2 = Channel 2 Settings
IDS_NTC_NTC_TYPE = NTC Selection:
IDS_NTC_R = Divider Resistor:
IDS_NTC_SET = NTC Parameters
IDS_NTC_B = β value:
IDS_NTC_TEMP = Temp Ranges:
IDS_NTC_RESISTANCE = Standard resistance:

IDS_MCU_COMMUNICATE = Communication Interface:
IDS_MCU_KEYSET = Key Settings:
IDS_MCU_SHOWBOARD = Display Interface:
IDS_MCU_BACKLIGHT = Alarm Light:
IDS_MCU_IOSET = IO Settings:

IDS_FINISH_TIP = Code has been generated!
IDS_FINISH_OPENPATH = Project Directory
IDS_FINISH_IDE3000 = Start HT-IDE3000

COMBOBOXITEM_Nothing = Nothing

IDS_ERROR_TDS = Incomplete TDS Settings !!!
IDS_ERROR_NTC = Incomplete NTC Settings !!
IDS_ERROR_MCU = Incomplete MCU Settings !



B_MCULIST_NOEFG=No .tfg file was found, initialization failed!
ERR_XMLFORMAT_ROOT = XML format error: root node is not 'TDS_MCU'
ERR_XMLFORMAT_LACKNODE = XML format error: Can not found node '<%s>'
ERR_XMLFORMAT_LACKATTRI = XML format error: Can not found attributes: <%s %s>
ERR_XMLFORMAT_PINREPEAT = XML format error: <Pin Index="%s"> redefinition
ERR_XMLFORMAT_FUNCREPEAT = XML format error: Functional redefinition of pin %s
ERR_XMLLOAD_LACKMGS = XML load error:Miss Message: %s
ERR_XMLFORMAT_NON_CONFORMITY = XML load error:%s is Non conformity


ERR_XMLFORMAT_PINIDX = XML format error: <Pin Index='%s'> exceeds total pin number(%s)
ERR_XMLLOAD_TDSCHANELDUAL =  XML format error:If TDS supports the dual-channel mode, both channel 1 and channel 2 should be defined.
ERR_XMLLOAD_TDSCHANELSINGLE =  XML format error:If TDS supports the single-channel mode, only channel 1 can be defined.
ERR_XMLLOAD_NTCCHANELDUAL =  XML format error:NTC supports dual-channel and must define both channel 1 and channel 2
ERR_XMLLOAD_NTCCHANELSINGLE =  XML format error:NTC supports single channel and can only define channel 1
ERR_XMLLOAD_NTCCHANELNONE =  XML format error:If NTC does not support any channel, neither channel 1 or channel 2 can be defined.
ERR_XMLFORMAT_PINFUNCNAME = XML format error: Unrecognized functions,<Feature Func="%s">
ERR_XMLFORMAT_TDSNOTEXIST = TDS_Devices.xml does not exist TDS device '%s'
ERR_XMLFORMAT_NTCNOTEXIST = NTC_Devices.xml does not exist NTC device '%s'
ERR_XMLFORMAT_PINCONFIGFUN = <PinConfig func="%s">,"%s" is unrecognizable
ERR_XMLFORMAT_COMBOXDEFVAL = Combox default value duplication(DefaultName,DefaultData)
ERR_XMLFORMAT_MACROSVALTYPE = <Macro ValueType="%s">,"%s" is unrecognizable
ERR_XMLFORMAT_MACROSVALREP = 'Value' and 'Value Type' can not appear at the same time in <Macro>
ERR_XMLFORMAT_MACROSNAMEREP = 'Name' and 'Name Type' can not appear at the same time in <Macro>
ERR_XMLFORMAT_MACRONAME = Macro names can contain only one %d
ERR_TDSXML_ROOT = TDS_Devices.XML format error: root node is not 'TDS_Devices'
ERR_MISS_FILE = Missing file '%s'
ERR_NTCXML_RNTCNUM = NTC tables must have 100 elements
ERR_NTCXML_ROOT = NTC_Devices.XML format error: root node is not 'NTC_Devices'
ERR_XMLFORMAT_LACKDDEFPIN = '%s' missing default pin
ERR_XMLFORMAT_CHANEMODEDEF = XML format error: The NTC channel preset value is larger than the TDS channel preset value.

ERR_LOADCHIP = Failed to load Chip '%s'
ERR_CANFINDPACKAGE = Can not find package '%s' in tfg
ERR_CANFINDTDSCHANEL = Can not find TDS Chanel %s in tfg
ERR_CANFINDNTCCHANEL = Can not find NTC Chanel %s in tfg

ERR_MCUNOTEXIST = Chip '%s' is not support
ERR_PACKAGENOTEXIST = Tfg does not support the '%s' package under the current project.
ERR_TDSCHANELMODENOTEXIST = Tfg does not support the TDS channel mode '%s' under the current project.
ERR_TDSDEVICENOTEXIST = Tfg does not support the TDS '%s' of the current project
ERR_TDSCALMODENOTEXIST = Tfg does not support the TDS Calibration mode '%s' of the current project
ERR_STYLEPNGNOTEXIST = Can not find style png resource of '%s'
ERR_DESCRIBEPNGNOTEXIST = Can not find Describe png resource of '%s'
ERR_TDSDOCNOTEXIST = Can not find documentation of '%s'
ERR_NTCCHANELMODENOTEXIST = Tfg does not support the NTC channel mode '%s' of the current project
ERR_NTCDEVICENOTEXIST = Tfg does not support the NTC '%s' of the current project
ERR_NTCVDRNOTEXIST = Tfg does not support the divider resistance '%s' of the current project
ERR_FSYSNOTEXIST = Tfg does not support the Fsys '%s' of the current project
ERR_FSUBNOTEXIST = Tfg does not support the Fsub '%s' of the current project
ERR_DISPLAYUINOTEXIST = Tfg does not support the diplay UI '%s' of the current project
ERR_BACKLIGHTNOTEXIST = Tfg does not support the backlight '%s' of the current project
ERR_COMNOTEXIST = Tfg does not support the COM '%s' of the current project
ERR_SEGNOTEXIST = Tfg does not support the SEG '%s' of the current project
ERR_R25NOTEXIST = Can not get R25 information of '%s' from NTC_Devices.xml
ERR_BETANOTEXIST =Can not get Beta information of '%s' from NTC_Devices.xml
ERR_TEMPNOTEXIST=Failed to obtain the temperature information of '%s' from NTC_Devices.xml
ERR_FILENAMEEMPTY = Project name can not be empty
ERR_TDS_TDSPINCONFLICT = '%s' pin conflict, whether to clear the pin configuration?
ERR_NTC_TDSPINCONFLICT =NTC channel %s needs to use the %s pin which has been occupied.
ERR_CreateDir = Failed to create Directory '%s'
ERR_PRJEXISTALREAD = The project name already exists!Do you want to overwite?
ERR_PINUNCONFIG = The '%s' pin has not been configured.
ERR_FAILEDTOGENMACRO = Failed to generate macros
ERR_FAILEDTOGENHFILE = Failed to generate .h file
IDS_LIB_MSG_002 = Fail to load %s library file!
IDS_LIB_MSG_003 = Fail to get %s address!
IDS_FAILEDCOPYFILE = Failed to copy file '%s'
IDS_FAILEDCREATEFILE = Failed to Create file '%s'
ERR_GENNTCTABLEFILE = Failed to generate NTC_Table.c



IDS_SUPPORTDISPLAY_Key =This mode does not support key settings, go on?*Yes:switch to this mode and clear the key settings*No: restore the previous settings
IDS_SUPPORTDISPLAY_Display = Detecting that this mode does not support Display settings, do you want to continue?*Yes:Switch to this mode and clear the Display settings*No:Restore previous settings

IDS_GENPROJRECT = Generating %s project
IDS_GENPROJRECTSU = %s project is generated successfully

IDS_NON_Channel = Non
IDS_Single_Channel = Single-channel
IDS_Dual_Channel = Dual-channel

TDS_NTCCHANGE = The NTC channel count should not exceed the TDS channel count. Please change the NTC channel to single-channel.

ERR_OPENFILEEXCEPTION = Failed to get '%s' when open file
IDS_OPENPROJECTERR = Failed to open '%s'
IDS_SaveBClose = Project configuration file '%s.pjtds' has been modified. Do you want to save?
IDS_SinglePointCal = Single-point Calibration
ERR_PRJNOTEXIST = Project '%s' does not exist
IDS_NotSupport = Not Support
IDS_LCD = LCD

IDS_UPDATE_CONNECT_FAILED = Failed to connect server
IDS_FOUND_NEW_VERSION2 = New version(%s)has been found, do you want to download? It will exit TDS Workshop after download is complete.
IDS_UPDATE_SAVEPACK = Do you want to save the Update Pack?
IDS_LATESTVER = it is the latest version
IDS_Downloading = Downloading
IDS_CANCEL = Cancel
IDS_UPDATE = Online Update
IDS_MCU_TIP = Tip:directly drag the corresponding function button or I/O pin to configure functions.

IDS_ISLCD_TIP = For simulation with LCD display function, E-Link will be powered by 3.3V by default. If you need to change it, please use IDE3000 to start the generated project and change the voltage value in SysVolt in the Configuration Option of Tools.
IDS_ISNOTLCD_TIP = For simulation without LCD display function, E-Link will be powered by 5V by default. If you need to change it, please use IDE3000 to start the generated project and change the voltage value in SysVolt in the Configuration Option of Tools.
IDS_UNENBLE_TIP = E-Link will simulate at 5V by default. If you need to change it, please use IDE3000 to start the generated project and change the voltage value in SysVolt in the Configuration Option of Tools

IDS_FSYS_CONTENT = HIRC-8MHz
IDS_FSUB_CONTENT = LIRC-32KHz

IDS_SELF_BUILT_RT_TABLE = Self built R-T table
IDS_Temperature_detection_range = Temperature detection range:
IDS_Temperature = Temperature
IDS_RESISTANCE = NTC resistance
IDS_OK = OK
IDS_Export_circuit_schematic_image = Export circuit schematic image
IDS_RT_Table_Not_Complete = The R-T table is incomplete
IDS_RESISTANCE_Out_Of_Range = The NTC resistance is out of range: 1K~100K
IDS_Next_Temperature_NTC_Less_Last = The %s°C NTC resistance must be greater than the %s°C NTC resistance
IDS_RT_Title = NTC Temperature Detection R-T Table
IDS_RT_Title_Less25 = The 25°C temperature has not been set
IDS_NTC_HELP = The divider resistor accuracy is recommended to be 0.1%
IDS_NTC_CIRCUIT_TYPE = NTC circuit type：
IDS_NTC_COM_TYPE1 = Type 1
IDS_NTC_COM_TYPE2 = Type 2
IDS_TDS_PIN_CONFIG = TDS Pin Configuration：
IDS_NTC_PIN_CONFIG = NTC Pin Configuration：

[Simp]
IDS_Title = TDS水质检测产品开发平台

IDS_Menu_Doc = 工程
IDS_Menu_Language = 语言
IDS_Menu_Tool = 工具
IDS_Menu_About = 说明

IDS_Menu_Doc_New = 新建工程
IDS_Menu_Doc_Open = 开启旧档
IDS_Menu_Doc_Save = 存储工程
IDS_Menu_Doc_SaveAs = 另存新档
IDS_Menu_Doc_Example = 平台实例
IDS_Menu_Doc_TDS = 水质检测笔
IDS_Menu_Doc_SingleTube = 单路TDS模块
IDS_Menu_Doc_DoubleTube = 双路TDS模块
IDS_Menu_Doc_Exit = 退出

IDS_Menu_Language_English = English
IDS_Menu_Language_SimpChinese = 简体中文
IDS_Menu_Language_TranChinese = 繁體中文

IDS_Menu_Tool_MonitoringWindow = 校准监测窗口
IDS_Menu_Tool_2 = 打开数据
IDS_Menu_Tool_3 = 储存数据
IDS_Menu_Tool_4 = 导出数据
IDS_Menu_Tool_5 = 打印

IDS_Menu_About_Direction = 使用说明
IDS_Menu_About_Instance = 实例说明
IDS_Menu_About_Update = 检测更新
IDS_Menu_About_About = 关于平台

IDS_EXAMPLE_NAME = 示例名称
IDS_EXAMPLE_Volt = 工作电压
IDS_EXAMPLE_Fre = 系统频率
IDS_EXAMPLE_MCU_MODEL = MCU 型号
IDS_EXAMPLE_TDS_SETTING = TDS 配置
IDS_EXAMPLE_NTC_SETTING = NTC 配置
IDS_EXAMPLE_COMMUNICATE = 通信接口
IDS_EXAMPLE_DISPLAY = 显示界面
IDS_EXAMPLE_BUTTON = 按钮
IDS_EXAMPLE_TEMPR = 温度范围
IDS_EXAMPLE_MECSURER = TDS测量范围
IDS_EXAMPLE_MECSUREA = TDS测量精度
IDS_EXAMPLE_NEW = 导出示例

IDS_NAVIGATION_Main = 起始
IDS_NAVIGATION_TDS = TDS配置
IDS_NAVIGATION_NTC = NTC配置
IDS_NAVIGATION_MCU = MCU配置
IDS_NAVIGATION_OVER = 完成

IDS_PageBegin_History = 最近开启工程
IDS_PageBegin_NewDoc =       新建工程       
IDS_PageBegin_Platform =       平台实例       
IDS_PageBegin_Calibration =       校准监测    

IDS_ProjectPathFind_STA = 选择当前工程路径
IDS_NEWPRJ_NAME = 工程名称:
IDS_NEWPRJ_LOCATION = 工程路径:
IDS_NEWPRJ_PACKAGE = 封装:
IDS_Next = 下一步
IDS_Over = 完成
IDS_Back = 上一步     
IDS_Return = 返回

IDS_TDS_MCU_TYPE = MCU 选型：
IDS_TDS_PACKAGE = 封装：
IDS_TDS_TUBE = TDS 通道：

IDS_TDS_TUBE1SET = 通道1配置
IDS_TDS_TUBE2SET = 通道2配置
IDS_TDS_PROBE_TYPE = 探针选型：
IDS_TDS_PROBE_MODE = 探针样式：
IDS_TDS_CALIBRATION_MODE = 校准模式：
IDS_TDS_DESCRIBE = 描述
IDS_TDS_DOCUMENT = 文档

IDS_NTC_NTCTUBE = NTC通道：
IDS_NTCTUBE_SET1 = 通道1配置
IDS_NTCTUBE_SET2 = 通道2配置
IDS_NTC_NTC_TYPE = NTC型号
IDS_NTC_R = 分压电阻：
IDS_NTC_SET = NTC 参数
IDS_NTC_B = β值：
IDS_NTC_TEMP = 温度范围：
IDS_NTC_RESISTANCE = 标称阻值：

IDS_MCU_COMMUNICATE = 通信接口：
IDS_MCU_KEYSET = 按键配置：
IDS_MCU_SHOWBOARD = 显示接口：
IDS_MCU_BACKLIGHT = 报警灯：
IDS_MCU_IOSET = I/O 引脚配置：

IDS_FINISH_TIP = 代码已生成！！！
IDS_FINISH_OPENPATH = 打开工程目录
IDS_FINISH_IDE3000 = 启动HT-IDE3000


COMBOBOXITEM_Nothing = 无

IDS_ERROR_TDS = 未完成配置TDS!!!
IDS_ERROR_NTC = 未完成配置NTC!!
IDS_ERROR_MCU = 未完成配置MCU!


B_MCULIST_NOEFG=未发现.tfg文件，初始化失败！
ERR_XMLFORMAT_ROOT = XML格式错误: 根节点不是'TDS_MCU'
ERR_XMLFORMAT_LACKNODE = XML格式错误:未找到键 '<%s>'
ERR_XMLFORMAT_LACKATTRI = XML格式错误: 未找到元素: <%s %s>
ERR_XMLFORMAT_PINREPEAT = XML格式错误: <Pin Index="%s"> 已定义
ERR_XMLFORMAT_FUNCREPEAT = XML格式错误: 引脚'%s'的功能重复定义
ERR_XMLLOAD_LACKMGS = XML格式错误:缺失信息: %s
ERR_XMLFORMAT_NON_CONFORMITY = XML格式错误:%s 不符合规范


ERR_XMLFORMAT_PINIDX = XML格式错误: <Pin Index='%s'> 超过总体Pin个数(%s)
ERR_XMLLOAD_TDSCHANELDUAL =  XML格式错误:TDS 支持双通道,必须定义通道 1 和通道 2
ERR_XMLLOAD_TDSCHANELSINGLE =  XML格式错误:TDS 支持单通道,只能定义通道 1
ERR_XMLLOAD_NTCCHANELDUAL =  XML格式错误:NTC 支持双通道,必须定义通道 1 和通道 2
ERR_XMLLOAD_NTCCHANELSINGLE =  XML格式错误:NTC 支持单通道,只能定义通道 1
ERR_XMLLOAD_NTCCHANELNONE =  XML格式错误:NTC 不支持通道,不能定义通道 1 或通道 2
ERR_XMLFORMAT_PINFUNCNAME = XML格式错误: 无法识别函数,<Feature Func="%s">
ERR_XMLFORMAT_TDSNOTEXIST = TDS_Devices.xml 不存在 TDS device '%s'
ERR_XMLFORMAT_NTCNOTEXIST = NTC_Devices.xml 不存在 NTC device '%s'
ERR_XMLFORMAT_PINCONFIGFUN = <PinConfig func="%s">,"%s" 无法识别
ERR_XMLFORMAT_COMBOXDEFVAL = 组合框默认值重复(DefaultName,DefaultData)
ERR_XMLFORMAT_MACROSVALTYPE = <Macro ValueType="%s">,"%s" 无法识别
ERR_XMLFORMAT_MACROSVALREP = 'Value' 和 'ValueType' 不能在 <Macro> 中同时出现
ERR_XMLFORMAT_MACROSNAMEREP = 'Name' 和 'NameType' 不能在 <Macro> 中同时出现
ERR_XMLFORMAT_MACRONAME = 只能包含唯一宏名 %d
ERR_TDSXML_ROOT = TDS_Devices.XML format error: 根节点不是 'TDS_Devices'
ERR_MISS_FILE = 未找到文件 '%s'
ERR_NTCXML_RNTCNUM = NTC表必须有100个元素
ERR_NTCXML_ROOT = NTC_Devices.XML format error: 根节点不是 'NTC_Devices'
ERR_XMLFORMAT_LACKDDEFPIN = '%s' 未发现默认引脚
ERR_XMLFORMAT_CHANEMODEDEF = XML format error: NTC 默认值大于 TDS 通道默认值

ERR_LOADCHIP = 载入芯片 '%s' 失败
ERR_CANFINDPACKAGE = 未在 tfg 中发现封装 '%s' 
ERR_CANFINDTDSCHANEL = 未在 tfg 中找到 TDS 通道 %s 
ERR_CANFINDNTCCHANEL = 未在 tfg 中找到 NTC 通道 %s 

ERR_MCUNOTEXIST = 不支持芯片 '%s' 
ERR_PACKAGENOTEXIST = Tfg 在当前的工程下不支持封装 '%s' 
ERR_TDSCHANELMODENOTEXIST = Tfg 在当前的工程下不支持 TDS 通道模式： '%s' 
ERR_TDSDEVICENOTEXIST = Tfg 在当前的工程下不支持 TDS '%s' 
ERR_TDSCALMODENOTEXIST = Tfg 在当前的工程下不支持 TDS 校准模式 '%s' 
ERR_STYLEPNGNOTEXIST = 未找到风格PNG资源 '%s'
ERR_DESCRIBEPNGNOTEXIST = 未找到描述用PNG资源 '%s'
ERR_TDSDOCNOTEXIST = 未找到 '%s' 文档
ERR_NTCCHANELMODENOTEXIST = Tfg 在当前的工程下不支持 NTC 通道模式： '%s' 
ERR_NTCDEVICENOTEXIST = Tfg 在当前的工程下不支持 NTC '%s' 
ERR_NTCVDRNOTEXIST = Tfg 在当前的工程下不支持分离电阻 '%s'
ERR_FSYSNOTEXIST = Tfg 在当前的工程下不支持 Fsys '%s'
ERR_FSUBNOTEXIST = Tfg 在当前的工程下不支持 Fsub '%s'
ERR_DISPLAYUINOTEXIST = Tfg 在当前的工程下不支持显示方案 '%s' 
ERR_BACKLIGHTNOTEXIST = Tfg 在当前的工程下不支持背光 '%s' 
ERR_COMNOTEXIST = Tfg 在当前的工程下不支持 COM '%s' 
ERR_SEGNOTEXIST = Tfg 在当前的工程下不支持 SEG '%s' 
ERR_R25NOTEXIST = 无法从 NTC_Devices.xml 获得关于 '%s' 的R25信息
ERR_BETANOTEXIST =无法从 NTC_Devices.xml 获得关于 '%s' 的β值信息
ERR_TEMPNOTEXIST= 无法从 NTC_Devices.xml 获得关于 '%s' 的温度信息
ERR_FILENAMEEMPTY = 工程名称不能为空
ERR_TDS_TDSPINCONFLICT = 引脚'%s'冲突,是否清除引脚配置
ERR_NTC_TDSPINCONFLICT = NTC 通道 %s 需求引脚 %s, 该引脚已被占用
ERR_CreateDir = 创建路径 '%s' 失败
ERR_PRJEXISTALREAD = 已存在该工程名称!是否将其覆盖?
ERR_PINUNCONFIG = 引脚 '%s' 未被配置
ERR_FAILEDTOGENMACRO = 生成宏失败
ERR_FAILEDTOGENHFILE = 生成 .h 文件失败
IDS_LIB_MSG_002 = 载入 %s 库文件失败!
IDS_LIB_MSG_003 = 得到地址 %s 失败!
IDS_FAILEDCOPYFILE = 复制文件 '%s' 失败
IDS_FAILEDCREATEFILE = 创建文件 '%s' 失败
ERR_GENNTCTABLEFILE = 生成 NTC_Table.c 失败
IDS_SUPPORTDISPLAY_Key = 检测到该模式不支持按键设置,是否继续?*是:切换到该模式并且清除按键设置*否:恢复之前的设置
IDS_SUPPORTDISPLAY_Display = 检测到该模式不支持显示设置,是否继续?*是:切换到该模式并且清除显示设置*否:恢复之前的设置

IDS_GENPROJRECT = 正在生成 %s 工程
IDS_GENPROJRECTSU = 生成 %s 工程成功

IDS_NON_Channel = 无
IDS_Single_Channel = 单通道
IDS_Dual_Channel = 双通道

TDS_NTCCHANGE = NTC 通道不能超过 TDS 通道数, NTC 通道修改为单通道.
ERR_OPENFILEEXCEPTION = 打开工程失败:无法获得'%s'
IDS_OPENPROJECTERR = 无法打开'%s'
IDS_SaveBClose = 工程配置文件'%s.pjtds'已经被修改，是否保存？
IDS_SinglePointCal = 单点校准
ERR_PRJNOTEXIST = 工程'%s'不存在
IDS_NotSupport = 无
IDS_LCD = LCD
IDS_UPDATE_CONNECT_FAILED = 连接服务器失败
IDS_FOUND_NEW_VERSION2 = 检测到新版本(%s)，是否下载？升级将退出TDS Workshop
IDS_UPDATE_SAVEPACK = 是否保存升级包？
IDS_LATESTVER = 当前已经是最新版本
IDS_Downloading = 正在下载
IDS_CANCEL = 取消
IDS_UPDATE = 在线升级
IDS_MCU_TIP = 提示:直接拖动对应的功能按钮或I/O引脚进行功能配置

IDS_ISLCD_TIP = 带有LCD显示功能的仿真，E-LINK将默认以3.3V供电。如需更改，请使用IDE3000启动生成的工程，在工具—配置选项—SysVolt中更改电压值
IDS_ISNOTLCD_TIP = 无LCD显示功能的仿真，E-LINK将默认以5V供电。如需更改，请使用IDE3000启动生成的工程，在工具—配置选项—SysVolt中更改电压值
IDS_UNENBLE_TIP = E-LINK将默认以5V进行仿真。如需更改，请使用IDE3000启动生成的工程，在工具—配置选项—SysVolt中更改电压值


IDS_FSYS_CONTENT = HIRC-8MHz
IDS_FSUB_CONTENT = LIRC-32KHz

IDS_SELF_BUILT_RT_TABLE = 自建R-T表
IDS_Temperature_detection_range = 温度检测范围:
IDS_Temperature = 温度
IDS_RESISTANCE = NTC阻值
IDS_OK = 确定
IDS_Export_circuit_schematic_image = 导出电路原理图图片
IDS_RT_Table_Not_Complete = R-T表未填写完整
IDS_RESISTANCE_Out_Of_Range = NTC阻值超出范围:1K~100K
IDS_Next_Temperature_NTC_Less_Last = %s°C NTC阻值必须大于%s°C NTC阻值
IDS_RT_Title = NTC温度检测R-T表
IDS_RT_Title_Less25 = 25°C温度未设置
IDS_NTC_HELP = 建议分压电阻精度为0.1%
IDS_NTC_CIRCUIT_TYPE = NTC电路类型
IDS_NTC_COM_TYPE1 = 类型一
IDS_NTC_COM_TYPE2 = 类型二
IDS_TDS_PIN_CONFIG = TDS引脚配置：
IDS_NTC_PIN_CONFIG = NTC引脚配置：

[Tran]
IDS_Title = TDS水質檢測產品開發平台

IDS_Menu_Doc = 專案
IDS_Menu_Language = 語言
IDS_Menu_Tool = 工具
IDS_Menu_About = 說明

IDS_Menu_Doc_New = 新建專案
IDS_Menu_Doc_Open = 開啟舊檔
IDS_Menu_Doc_Save = 存儲專案
IDS_Menu_Doc_SaveAs = 另存新檔
IDS_Menu_Doc_Example = 平台實例
IDS_Menu_Doc_TDS = 水質檢測筆
IDS_Menu_Doc_SingleTube = 單路TDS模塊
IDS_Menu_Doc_DoubleTube = 雙路TDS模塊
IDS_Menu_Doc_Exit = 退出

IDS_Menu_Language_English = English
IDS_Menu_Language_SimpChinese = 简体中文
IDS_Menu_Language_TranChinese = 繁體中文

IDS_Menu_Tool_MonitoringWindow = 校準監測窗口
IDS_Menu_Tool_2 = 打開數據
IDS_Menu_Tool_3 = 存儲數據
IDS_Menu_Tool_4 = 導出數據
IDS_Menu_Tool_5 = 打印

IDS_Menu_About_Direction = 使用說明
IDS_Menu_About_Instance = 實例說明
IDS_Menu_About_Update = 檢測更新
IDS_Menu_About_About = 關於平台

IDS_EXAMPLE_NAME = 示例名稱
IDS_EXAMPLE_Volt = 工作電壓
IDS_EXAMPLE_Fre = 系統頻率
IDS_EXAMPLE_MCU_MODEL = MCU 型號
IDS_EXAMPLE_TDS_SETTING = TDS 配置
IDS_EXAMPLE_NTC_SETTING = NTC 配置
IDS_EXAMPLE_COMMUNICATE = 通信接口
IDS_EXAMPLE_DISPLAY = 顯示界面
IDS_EXAMPLE_BUTTON = 按鈕
IDS_EXAMPLE_TEMPR = 溫度範圍
IDS_EXAMPLE_MECSURER = TDS測量範圍
IDS_EXAMPLE_MECSUREA = TDS測量精度
IDS_EXAMPLE_NEW = 導出示例

IDS_NAVIGATION_Main = 起始
IDS_NAVIGATION_TDS = TDS配置
IDS_NAVIGATION_NTC = NTC配置
IDS_NAVIGATION_MCU = MCU配置
IDS_NAVIGATION_OVER = 完成

IDS_PageBegin_History = 最近開啟專案
IDS_PageBegin_NewDoc =        新建專案       
IDS_PageBegin_Platform =        平台實例       
IDS_PageBegin_Calibration =        校準監測    

IDS_ProjectPathFind_STA = 選擇當前專案路徑
IDS_NEWPRJ_NAME = 專案名稱:
IDS_NEWPRJ_LOCATION = 專案路徑:
IDS_NEWPRJ_PACKAGE = 封裝:
IDS_Next = 下一步
IDS_Over = 完成
IDS_Back = 上一步      
IDS_Return = 返回

IDS_TDS_MCU_TYPE = MCU 選型：
IDS_TDS_PACKAGE = 封裝：
IDS_TDS_TUBE = TDS 通道：

IDS_TDS_TUBE1SET = 通道1配置
IDS_TDS_TUBE2SET = 通道2配置
IDS_TDS_PROBE_TYPE = 探針選型：
IDS_TDS_PROBE_MODE = 探針樣式：
IDS_TDS_CALIBRATION_MODE = 校準模式：
IDS_TDS_DESCRIBE = 描述
IDS_TDS_DOCUMENT = 文檔

IDS_NTC_NTCTUBE = NTC通道：
IDS_NTCTUBE_SET1 = 通道1配置
IDS_NTCTUBE_SET2 = 通道2配置
IDS_NTC_NTC_TYPE = NTC型號
IDS_NTC_R = 分壓電阻：
IDS_NTC_SET = NTC 參數
IDS_NTC_B = β值：
IDS_NTC_TEMP = 溫度範圍：
IDS_NTC_RESISTANCE = 標稱阻值：

IDS_MCU_COMMUNICATE = 通訊介面：
IDS_MCU_KEYSET = 按鍵設置：
IDS_MCU_SHOWBOARD = 顯示介面：
IDS_MCU_BACKLIGHT = 報警燈：
IDS_MCU_IOSET = I/O 引腳配置：

IDS_FINISH_TIP = 代碼已生成！！！
IDS_FINISH_OPENPATH = 打開工程目錄
IDS_FINISH_IDE3000 = 啟動HT-IDE3000

COMBOBOXITEM_Nothing = 無

IDS_ERROR_TDS = 未完成配置TDS!!!
IDS_ERROR_NTC = 未完成配置NTC!!
IDS_ERROR_MCU = 未完成配置MCU!


B_MCULIST_NOEFG=未發現.tfg檔案，初始化失敗！
ERR_XMLFORMAT_ROOT = XML格式錯誤: 根節點不是'TDS_MCU'
ERR_XMLFORMAT_LACKNODE = XML格式錯誤:未找到鍵 '<%s>'
ERR_XMLFORMAT_LACKATTRI = XML格式錯誤: 未找到元素: <%s %s>
ERR_XMLFORMAT_PINREPEAT = XML格式錯誤: <Pin Index="%s"> 已定義
ERR_XMLFORMAT_FUNCREPEAT = XML格式錯誤: 引腳'%s'的功能重複定義
ERR_XMLLOAD_LACKMGS = XML格式錯誤:缺失信息: %s
ERR_XMLFORMAT_NON_CONFORMITY = XML格式錯誤:%s 不符合規範


ERR_XMLFORMAT_PINIDX = XML格式錯誤: <Pin Index='%s'> 超過總體Pin個數(%s)
ERR_XMLLOAD_TDSCHANELDUAL =  XML格式錯誤:TDS 支持雙通道,必須定義通道 1 和通道 2
ERR_XMLLOAD_TDSCHANELSINGLE =  XML格式錯誤:TDS 支持單通道,只能定義通道 1
ERR_XMLLOAD_NTCCHANELDUAL =  XML格式錯誤:NTC 支持雙通道,必須定義通道 1 和通道 2
ERR_XMLLOAD_NTCCHANELSINGLE =  XML格式錯誤:NTC 支持單通道,只能定義通道 1
ERR_XMLLOAD_NTCCHANELNONE =  XML格式錯誤:NTC 不支持通道,不能定義通道 1 或通道 2
ERR_XMLFORMAT_PINFUNCNAME = XML格式錯誤: 無法識別函數,<Feature Func="%s">
ERR_XMLFORMAT_TDSNOTEXIST = TDS_Devices.xml 不存在 TDS device '%s'
ERR_XMLFORMAT_NTCNOTEXIST = NTC_Devices.xml 不存在 NTC device '%s'
ERR_XMLFORMAT_PINCONFIGFUN = <PinConfig func="%s">,"%s" 無法識別
ERR_XMLFORMAT_COMBOXDEFVAL = 組合框默認值重複(DefaultName,DefaultData)
ERR_XMLFORMAT_MACROSVALTYPE = <Macro ValueType="%s">,"%s" 無法識別
ERR_XMLFORMAT_MACROSVALREP = 'Value' 和 'ValueType' 不能在 <Macro> 中同時出現
ERR_XMLFORMAT_MACROSNAMEREP = 'Name' 和 'NameType' 不能在 <Macro> 中同時出現
ERR_XMLFORMAT_MACRONAME = 只能包含唯一宏名 %d
ERR_TDSXML_ROOT = TDS_Devices.XML format error: 根節點不是 'TDS_Devices'
ERR_MISS_FILE = 未找到文件 '%s'
ERR_NTCXML_RNTCNUM = NTC表必須有100個元素
ERR_NTCXML_ROOT = NTC_Devices.XML format error: 根節點不是 'NTC_Devices'
ERR_XMLFORMAT_LACKDDEFPIN = '%s' 未发现默认引脚
ERR_XMLFORMAT_CHANEMODEDEF = XML format error: NTC 默認值大於 TDS 通道默認值

ERR_LOADCHIP = 載入芯片 '%s' 失敗
ERR_CANFINDPACKAGE = 未在 tfg 中發現封裝 '%s' 
ERR_CANFINDTDSCHANEL = 未在 tfg 中找到 TDS 通道 %s 
ERR_CANFINDNTCCHANEL = 未在 tfg 中找到 NTC 通道 %s 

ERR_MCUNOTEXIST = 不支持芯片 '%s' 
ERR_PACKAGENOTEXIST = Tfg 在當前的專案下不支持封裝 '%s' 
ERR_TDSCHANELMODENOTEXIST = Tfg 在當前的專案下不支持 TDS 通道模式： '%s' 
ERR_TDSDEVICENOTEXIST = Tfg 在當前的專案下不支持 TDS '%s' 
ERR_TDSCALMODENOTEXIST = Tfg 在當前的專案下不支持 TDS 校準模式 '%s' 
ERR_STYLEPNGNOTEXIST = 未找到風格PNG資源 '%s'
ERR_DESCRIBEPNGNOTEXIST = 未找到描述用PNG資源 '%s'
ERR_TDSDOCNOTEXIST = 未找到 '%s' 文檔
ERR_NTCCHANELMODENOTEXIST = Tfg 在當前的專案下不支持 NTC 通道模式： '%s' 
ERR_NTCDEVICENOTEXIST = Tfg 在當前的專案下不支持 NTC '%s' 
ERR_NTCVDRNOTEXIST = Tfg 在當前的專案下不支持分壓電阻 '%s'
ERR_FSYSNOTEXIST = Tfg 在當前的專案下不支持 Fsys '%s'
ERR_FSUBNOTEXIST = Tfg 在當前的專案下不支持 Fsub '%s'
ERR_DISPLAYUINOTEXIST = Tfg 在當前的專案下不支持顯示方案 '%s' 
ERR_BACKLIGHTNOTEXIST = Tfg 在當前的專案下不支持背光 '%s' 
ERR_COMNOTEXIST = Tfg 在當前的專案下不支持 COM '%s' 
ERR_SEGNOTEXIST = Tfg 在當前的專案下不支持 SEG '%s' 
ERR_R25NOTEXIST = 無法從 NTC_Devices.xml 獲得關於 '%s' 的R25信息
ERR_BETANOTEXIST =無法從 NTC_Devices.xml 獲得關於 '%s' 的β值信息
ERR_TEMPNOTEXIST= 無法從 NTC_Devices.xml 獲得關於 '%s' 的溫度信息
ERR_FILENAMEEMPTY = 專案名稱不能為空
ERR_TDS_TDSPINCONFLICT = 引腳'%s'衝突,是否清除引腳配置
ERR_NTC_TDSPINCONFLICT = NTC 通道 %s 需求引腳 %s, 該引腳已被佔用
ERR_CreateDir = 創建路徑 '%s' 失敗
ERR_PRJEXISTALREAD = 已存在該專案名稱!是否將其覆蓋?
ERR_PINUNCONFIG = 引腳 '%s' 未被配置
ERR_FAILEDTOGENMACRO = 生成宏失敗
ERR_FAILEDTOGENHFILE = 生成 .h 文件失敗
IDS_LIB_MSG_002 = 載入 %s 庫文件失敗!
IDS_LIB_MSG_003 = 得到地址 %s 失敗!
IDS_FAILEDCOPYFILE = 複製文件 '%s' 失敗
IDS_FAILEDCREATEFILE = 創建文件 '%s' 失敗
ERR_GENNTCTABLEFILE = 生成 NTC_Table.c 失敗
IDS_SUPPORTDISPLAY_Key = 檢測到該模式不支援按鍵設定,是否繼續?*是:切換到該模式並且清除按鍵設定*否:恢復之前的設置
IDS_SUPPORTDISPLAY_Display = 檢測到該模式不支援顯示設定,是否繼續?*是:切換到該模式並且清除顯示設定*否:恢復之前的設置

IDS_GENPROJRECT = 正在生成 %s 專案
IDS_GENPROJRECTSU = 生成 %s 專案成功

IDS_NON_Channel = 無
IDS_Single_Channel = 單通道
IDS_Dual_Channel = 雙通道

TDS_NTCCHANGE = NTC 通道不能超過 TDS 通道數, NTC 通道修改為單通道.
ERR_OPENFILEEXCEPTION = 打開工程失敗:無法獲得'%s'
IDS_OPENPROJECTERR = 無法打開'%s'
IDS_SaveBClose = 工程配置文件'%s.pjtds'已經被修改，是否保存？
IDS_SinglePointCal = 單點校準
ERR_PRJNOTEXIST = 工程'%s'不存在
IDS_NotSupport = 無
IDS_LCD = LCD
IDS_UPDATE_CONNECT_FAILED = 連接服務器失敗
IDS_FOUND_NEW_VERSION2 = 檢測到新版本(%s)，是否下載？升級將退出TDS Workshop
IDS_UPDATE_SAVEPACK = 是否儲存升級包？
IDS_LATESTVER = 當前已經是最新版本
IDS_Downloading = 正在下載
IDS_CANCEL = 取消
IDS_UPDATE = 在綫升級
IDS_MCU_TIP = 提示:直接拖動對應的功能按鈕或I/O引腳進行功能配置

IDS_ISLCD_TIP = 帶有LCD顯示功能的仿真，E-LINK将默认以3.3V供電。如需更改，請使用IDE3000啟動生成的專案，在工具—配置選項—SysVolt中更改電壓值
IDS_ISNOTLCD_TIP = 無LCD顯示功能的仿真，E-LINK将默认以5V供電。如需更改，請使用IDE3000啟動生成的專案，在工具—配置選項—SysVolt中更改電壓值
IDS_UNENBLE_TIP = E-LINK將默認以5V進行仿真。如需更改，請使用IDE3000啟動生成的專案，在工具—配置選項—SysVolt中更改電壓值


IDS_FSYS_CONTENT = HIRC-8MHz
IDS_FSUB_CONTENT = LIRC-32KHz


IDS_SELF_BUILT_RT_TABLE = 自建R-T表
IDS_Temperature_detection_range = 溫度檢測範圍:
IDS_Temperature = 溫度
IDS_RESISTANCE = NTC阻值
IDS_OK = 確定
IDS_Export_circuit_schematic_image = 導出電路原理圖圖片
IDS_RT_Table_Not_Complete = R-T表未填寫完整
IDS_RESISTANCE_Out_Of_Range = NTC阻值超出範圍:1K~100K
IDS_Next_Temperature_NTC_Less_Last = %s°C NTC阻值必須大於%s°C NTC阻值
IDS_RT_Title = NTC溫度檢測R-T表
IDS_RT_Title_Less25 = 25°C溫度未設置
IDS_NTC_HELP = 建議分壓電阻精度為0.1%
IDS_NTC_CIRCUIT_TYPE = NTC電路類型
IDS_NTC_COM_TYPE1 = 類型一
IDS_NTC_COM_TYPE2 = 類型二
IDS_TDS_PIN_CONFIG = TDS引腳配置：
IDS_NTC_PIN_CONFIG = NTC引腳配置：